Reports/РеестрИНПССводный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>РеестрИНПССводный</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Платежка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РеестрИНПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РеестрИНПС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>CalculationRegister.Удержания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьПоБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпорядочитьПоФамилии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляСортировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>29</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаНарастающим</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобровольныйВзнос</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/РеестрИНПССводный/Ext/ObjectModule.bsl
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьДанные(КонецПериода)  Экспорт
	
	Запрос=новый Запрос;
			
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(КонецПериода));

	КонецПрМесяца=НачалоМесяца(КонецПериода)-1;
  	Запрос.УстановитьПараметр("НачалоПрПериода",НачалоМесяца(КонецПрМесяца));
	Запрос.УстановитьПараметр("КонецПрПериода",КонецМесяца(КонецПрМесяца));

	Если НачалоМесяца(КонецПериода)=НачалоГода(КонецПериода) Тогда
		Запрос.Текст=
		"ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ИНПС КАК ИНПС,
		|	РеестрИНПССотрудники.Результат КАК Результат,
		|	РеестрИНПССотрудники.БазаНарастающим КАК База
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|		ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|ГДЕ
		|	РеестрИНПССотрудники.Ссылка.Проведен
		|	И РеестрИНПС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РеестрИНПССотрудники.Результат > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрИНПССотрудники.Сотрудник.Наименование
		|ИТОГИ
		|	СУММА(Результат),
		|	СУММА(База)
		|ПО
		|	ОБЩИЕ";
	Иначе
		Запрос.Текст=
		"ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ИНПС КАК ИНПС,
		|	РеестрИНПССотрудники.Результат КАК Результат,
		|	ЕСТЬNULL(РеестрИНПССотрудники.БазаНарастающим, 0) - ЕСТЬNULL(ВложенныйЗапрос.БазаПр, 0) КАК База
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|		ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеестрИНПССотрудники.Сотрудник КАК Сотрудник,
		|			РеестрИНПССотрудники.БазаНарастающим КАК БазаПр
		|		ИЗ
		|			Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|				ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ГДЕ
		|			РеестрИНПС.Проведен
		|			И РеестрИНПС.Дата МЕЖДУ &НачалоПрПериода И &КонецПрПериода) КАК ВложенныйЗапрос
		|		ПО РеестрИНПССотрудники.Сотрудник = ВложенныйЗапрос.Сотрудник
		|ГДЕ
		|	РеестрИНПССотрудники.Ссылка.Проведен
		|	И РеестрИНПССотрудники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РеестрИНПССотрудники.Результат > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрИНПССотрудники.Сотрудник.Наименование
		|ИТОГИ
		|	СУММА(Результат),
		|	СУММА(База)
		|ПО
		|	ОБЩИЕ";
	КонецЕсли;  	
	Возврат Запрос.Выполнить(); 
	
КонецФункции // ПолучитьДанные()

Процедура ФормироватьФайлИНПС_( КонецПериода, ИмяФайлаДанных)  Экспорт
	
	НомерПлатПоручения = Платежка.Номер ;
	ДатаПлатПоручения  = Платежка.Дата ; 
	
	Запрос=новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(КонецПериода));

	Если НачалоМесяца(КонецПериода)=НачалоГода(КонецПериода) Тогда
		Запрос.Текст=
		"ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ИНПС КАК ИНПС,
		|	РеестрИНПССотрудники.Результат КАК Результат,
		|	РеестрИНПССотрудники.БазаНарастающим КАК База,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|		ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	РеестрИНПССотрудники.Ссылка.Проведен
		|	И РеестрИНПССотрудники.Результат > 0
		|	И РеестрИНПССотрудники.БазаНарастающим > 0
		|	И РеестрИНПС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрИНПССотрудники.Сотрудник.Наименование
		|ИТОГИ
		|	СУММА(Результат),
		|	СУММА(База)
		|ПО
		|	ОБЩИЕ";
	Иначе
		Запрос.Текст=
		"ВЫБРАТЬ
		|	РеестрИНПССотрудники.Сотрудник,
		|	РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо.ИНПС КАК ИНПС,
		|	РеестрИНПССотрудники.Результат КАК Результат,
		|	ЕСТЬNULL(РеестрИНПССотрудники.БазаНарастающим, 0) - ЕСТЬNULL(ВложенныйЗапрос.БазаПр, 0) КАК База,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ИЗ
		|	Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|		ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеестрИНПССотрудники.Сотрудник КАК Сотрудник,
		|			РеестрИНПССотрудники.БазаНарастающим КАК БазаПр
		|		ИЗ
		|			Документ.РеестрИНПС.Сотрудники КАК РеестрИНПССотрудники
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрИНПС КАК РеестрИНПС
		|				ПО РеестрИНПССотрудники.Ссылка = РеестрИНПС.Ссылка
		|		ГДЕ
		|			РеестрИНПС.Проведен
		|			И РеестрИНПС.Дата МЕЖДУ &НачалоПрПериода И &КонецПрПериода) КАК ВложенныйЗапрос
		|		ПО РеестрИНПССотрудники.Сотрудник = ВложенныйЗапрос.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО РеестрИНПССотрудники.Сотрудник.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	РеестрИНПССотрудники.Ссылка.Проведен
		|	И РеестрИНПССотрудники.Результат > 0
		|	И РеестрИНПССотрудники.БазаНарастающим > 0
		|	И РеестрИНПС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрИНПССотрудники.Сотрудник.Наименование
		|ИТОГИ
		|	СУММА(Результат),
		|	СУММА(База)
		|ПО
		|	ОБЩИЕ";
		КонецПрМесяца=НачалоМесяца(КонецПериода)-1;
		Запрос.УстановитьПараметр("НачалоПрПериода",НачалоМесяца(КонецПрМесяца));
		Запрос.УстановитьПараметр("КонецПрПериода",КонецМесяца(КонецПрМесяца));

	КонецЕсли;   	
	
	Результат = Запрос.Выполнить(); 
	
	Выборка = Результат.Выбрать();
	
	Сообщить("Формируется файл выгрузки ...");
	Документ = Новый ТекстовыйДокумент;
	
	СимволРазделитель = Символ(29);
	СтрокаРеестра = "1" + СимволРазделитель + "Version" + СимволРазделитель;
	
	// первая строка 
	Документ.ДобавитьСтроку(СтрокаРеестра);
	
	// вторая строка
	Если Выборка.Следующий() Тогда
		
		СтрокаРеестра = СокрЛП(НомерРеестра) + СимволРазделитель + СимволРазделитель + СимволРазделитель 
		+ СокрЛП(НомерПлатПоручения) + СимволРазделитель
		+ Формат(ДатаПлатПоручения,"ДЛФ=D") + СимволРазделитель 
		+ СокрЛП(ОсновнаяОрганизация.ИНН) + СимволРазделитель 
		+ Формат(Выборка.Количество()-1,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
		+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
		+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель + "0" + СимволРазделитель + СимволРазделитель
		+ Формат(КонецПериода,"ДЛФ=D") + СимволРазделитель + Формат(КонецМесяца(КонецПериода),"ДЛФ=D") + СимволРазделитель
		+ Формат(Выборка.База*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель;	
		Документ.ДобавитьСтроку(СтрокаРеестра);
		
	КонецЕсли;
	
	// следующие строки
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИНПС) и Выборка.Результат > 0 Тогда
			СтрокаРеестра = СокрЛП(Выборка.ИНПС) + СимволРазделитель 
			+ СокрЛП(Выборка.Фамилия) + СимволРазделитель
			+ СокрЛП(Выборка.Имя) + СимволРазделитель 
			+ СокрЛП(Выборка.Отчество) + СимволРазделитель
			+ Формат(Выборка.База*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель
			+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
			+ Формат(Выборка.Результат*100,"ЧЦ=20; ЧДЦ=0; ЧГ=") + СимволРазделитель 
			+ "0" + СимволРазделитель + СимволРазделитель + СимволРазделитель;
			Документ.ДобавитьСтроку(СтрокаРеестра);
		КонецЕсли;
		
	КонецЦикла;
	
	Документ.Записать(ИмяФайлаДанных,"windows-1251");
	Сообщить("Файл выгрузки сформирован!");
	
КонецПроцедуры
